---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnDuct
source: html/b748af62-da37-f2c4-4e89-248458c5c829.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.FittingMustBeOnDuct Property

The [Tap] must be attached to duct.

## Syntax (C#)
```csharp
public static FailureDefinitionId FittingMustBeOnDuct { get; }
```